// - Описати скріпт, котрий, якщо доєднати до будь-якої сторінки дозволить зробити наступне:
//     При лівому кліку миші вивести в консоль інформацію про блок або елемент на який відбувся клік.
//     Інформація яку потрібно вивести: Назва тегу, список класів, список ід, розміри в форматі висота*ширина

function explorer1(htmlElement) {
    htmlElement.onclick = function () {
        if (!htmlElement.children.length) {
            console.log(htmlElement.tagName);
            console.log(htmlElement.classList);
            console.log(htmlElement.getAttribute('id'));
        }
    }
    if (htmlElement.children.length) {
        for (let child of htmlElement.children) {
            explorer1(child);
        }
    }
}

explorer1(document.body);

//Працює та не до кінця,якщо не вводити перевірку в 7 строці, то буде видавати інформаію про елемент на який натиснули і про всі елементи, що лежать під ним
//наприклад якщо натиснули на li, то виведеться інфа про li, ul, div, body
//Якщо з перевіркою, то при натисканні на батьківський для ul дів, нічого не відбувається
//Так от і питання, як виділити лише верхній елемент, на який натиснули?


// - Описати скріпт, котрий, якщо доєднати до будь-якої сторінки дозволить зробити наступне:
//     При лівому кліку миші  зробить popup (спливаючий блок) в якому буде вся інформація про блок.
//     Інформація яку потрібно вивести в popup: Назва тегу, список класів, список ід, розміри в форматі висота*ширина







// *****(Прям овердоз с рекурсией) Создать функцию которая принимает какой-либо элемент DOM-структуры .Функция создает в боди 2 кнопки (назад/вперед)
// при нажатии вперед, вы переходите к дочернему элементу, при еще одном нажатии на "вперед", вы переходите к следующему дочернему элементу (лежащему на одном уровне)
// НО если у (какого-либо)дочеренего элемента есть дети, то нажатие "вперед" позволяет нам войти внутрь элемента и  выводит первого ребенка. и тд.
//     Когда все дети заканчиваются, мы выходим из данного дочернего элемента и переходим к следующему, лежащему с ним на одном уровне


//     Завдання важке для розуміння, але дуже легке в реалізації. Тут треба буде погуглити
// *** При виділені сегменту тексту на сторінці він стає жирний/курсивний/або якось іншим способом змінює свій стан
